; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	thermograph0 - mode
	image1 - mode
	Star0 - direction
	GroundStation1 - direction
	Star4 - direction
	Star11 - direction
	GroundStation9 - direction
	GroundStation5 - direction
	Star13 - direction
	Star10 - direction
	GroundStation2 - direction
	Star12 - direction
	GroundStation3 - direction
	Star8 - direction
	Star6 - direction
	Star7 - direction
	GroundStation14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Star18 - direction
	Star19 - direction
	Planet20 - direction
	Planet21 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 Star10)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 Star8)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument1 image1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star12)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star10)
	(calibration_target instrument2 Star13)
	(supports instrument3 thermograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 Star8)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star12)
	(supports instrument4 image1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation14)
	(calibration_target instrument4 Star7)
	(calibration_target instrument4 Star6)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation9)
)
(:goal (and
	(pointing satellite1 Star12)
	(have_image Phenomenon16 thermograph0)
	(have_image Star17 thermograph0)
	(have_image Star18 image1)
	(have_image Star19 thermograph0)
	(have_image Planet20 thermograph0)
	(have_image Planet21 image1)
))

)

; plan
1. (turn_to satellite2 groundstation3 groundstation9)
   deleted: (pointing satellite2 groundstation9)
   added: (pointing satellite2 groundstation3)
   goals met: 1 of 7
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 1 of 7
3. (calibrate satellite2 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 1 of 7
4. (turn_to satellite2 planet21 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 planet21)
   goals met: 1 of 7
5. (take_image satellite2 planet21 instrument3 image1)
   added: (have_image planet21 image1)
   goals met: 2 of 7
6. (turn_to satellite2 planet20 planet21)
   deleted: (pointing satellite2 planet21)
   added: (pointing satellite2 planet20)
   goals met: 2 of 7
7. (take_image satellite2 planet20 instrument3 thermograph0)
   added: (have_image planet20 thermograph0)
   goals met: 3 of 7
8. (turn_to satellite2 phenomenon16 planet20)
   deleted: (pointing satellite2 planet20)
   added: (pointing satellite2 phenomenon16)
   goals met: 3 of 7
9. (take_image satellite2 phenomenon16 instrument3 thermograph0)
   added: (have_image phenomenon16 thermograph0)
   goals met: 4 of 7
10. (turn_to satellite2 star17 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 star17)
   goals met: 4 of 7
11. (take_image satellite2 star17 instrument3 thermograph0)
   added: (have_image star17 thermograph0)
   goals met: 5 of 7
12. (turn_to satellite2 star18 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 star18)
   goals met: 5 of 7
13. (take_image satellite2 star18 instrument3 image1)
   added: (have_image star18 image1)
   goals met: 6 of 7
14. (turn_to satellite2 star19 star18)
   deleted: (pointing satellite2 star18)
   added: (pointing satellite2 star19)
   goals met: 6 of 7
15. (take_image satellite2 star19 instrument3 thermograph0)
   added: (have_image star19 thermograph0)
   goals met: 7 of 7
